const birthday = "18.04.1982";

const age = someCode(birthday);

const BIRTHDAY = "18.04.1982"; // 대문자 상수로 바꿔도 괜찮을까요? -> 하드 코딩된 변하지 않는 상수이기 때문에 대문자 상수가 적합하다.

const AGE = someCode(BIRTHDAY); // 대문자 상수로 바꿔도 괜찮을까요? -> 런타임에 평가되는 값이기 때문에 실행마다 값이 다를 수 있으므로 대문자 상수가 적합하지 않다.

/**
 * 대문자 상수는 ‘하드 코딩한’ 값의 별칭을 만들 때 주로 사용합니다. 실행 전에 이미 값을 알고 있고, 코드에서 직접 그 값을 쓰는 경우에 사용하죠.
 *
 * 위 코드에서 birthday가 그런 경우입니다. 따라서 birthday는 대문자 상수로 적합합니다.
 *
 * 반면, age는 런타임에 평가됩니다. 올해의 나이와 내년의 나이는 다르죠. 상수는 코드가 실행될 때마다 바뀌지 않아야 하는 값이란 걸 아마 느끼셨을 겁니다.
 * 이런 관점에서 보았을 때, age는 birthday보다 덜 상수스럽습니다. 런타임에 계산되죠. 따라서 age는 대문자 상수에 적합하지 않습니다.
 */
